myquote1/app/views/quotes/_form.html.erb

SELECT "philosophers".* FROM "philosophers"
---
  <div class="form-group" style="padding-bottom: 10px;">
    <%= f.collection_select :philosopher_id, Philosopher.all, :id, Proc.new{ |p| "#{p.fname} #{p.lname}" }, prompt: 'Who is the quote attributed to?', class: 'form-control' %>

SELECT "quote_lists".* FROM "quote_lists" WHERE "quote_lists"."quote_id" = ?  [["quote_id", 3]]
---
  <div id="categories-container">
      <% @quote.quote_lists.each do |ql| %>

SELECT "categories".* FROM "categories"
---
              <%= quote_list.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
              <%= quote_list.select :category_id, Category.all.collect { |cg| [cg.name, cg.id] }, { include_blank: true }, class: "form-control d-inline-block" %>

SELECT "categories".* FROM "categories"
---
// Wait for the document to be fully loaded
document.addEventListener('DOMContentLoaded', function() {
  // Attach an event listener to detect clicks on the "Remove this category" link
  document.addEventListener('click', function(e) {
    if (e.target && e.target.classList.contains('remove-category')) {
      // Prevent the default action of the link
      e.preventDefault();

      // Get all the ingredient fields
      const categoryFields = document.querySelectorAll('.category-field');
      // Only remove an ingredient field if there's more than one
      if (categoryFields.length > 1) {
        e.target.closest('.category-field').remove();
      }
    }
  });
});