myquote1/app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:categories).take(5)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 11], ["id", 3]]
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC LIMIT ?  [["LIMIT", 5]]

  def uquotes
    @quotes = Quote.includes(:quote_lists).where(user_id: session[:user_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 6]]
SELECT "quote_lists".* FROM "quote_lists" WHERE "quote_lists"."quote_id" IN (?, ?, ?, ?, ?)  [["quote_id", 7], ["quote_id", 6], ["quote_id", 5], ["quote_id", 4], ["quote_id", 3]]