myquote1/app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."isPublic" = ? ORDER BY "quotes"."created_at" DESC LIMIT ?  [["isPublic", 1], ["LIMIT", 5]]
---
  def index
    # Sort the quotes in descending order by timestamp and grab the first five
    @quotes = Quote.order(created_at: :desc).where(isPublic: true).take(5)