myquote1/app/controllers/philosophers_controller.rb

  def index
    @philosophers = Philosopher.all
---
SELECT "philosophers".* FROM "philosophers"

  def show
    # Set @quotes to only display quotes by this Philosopher
    @philosopher = Philosopher.find(params[:id])
    @quotes = Quote.where(philosopher: @philosopher, isPublic: true)
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."philosopher_id" = ? AND "quotes"."isPublic" = ?  [["philosopher_id", 1], ["isPublic", 1]]

  def create
    @philosopher = Philosopher.new(philosopher_params)
    respond_to do |format|
      if @philosopher.save
---
INSERT INTO "philosophers" ("fname", "lname", "birth_year", "death_year", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @philosopher.update(philosopher_params)
---
UPDATE "philosophers" SET "lname" = ?, "updated_at" = ? WHERE "philosophers"."id" = ?  [["lname", ""], ["updated_at", "2023-10-11 11:29:03.829842"], ["id", 2]]

    def set_philosopher
      @philosopher = Philosopher.find(params[:id])
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]