myquote1/app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
  def index
    @quotes = Quote.all

INSERT INTO "quotes" ("quote_text", "publication_year", "comment", "user_id", "created_at", "updated_at", "philosopher_id", "isPublic") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "updated_at" = ?, "isPublic" = ? WHERE "quotes"."id" = ?  [["updated_at", "2023-10-14 03:22:32.567098"], ["isPublic", 1], ["id", 5]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 1]]
---
  def destroy
    @quote.destroy