myquote1/app/controllers/quote_lists_controller.rb

SELECT "quote_lists".* FROM "quote_lists"
---
  def index
    @quote_lists = QuoteList.all

SELECT "quote_lists".* FROM "quote_lists" WHERE "quote_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_quote_list
      @quote_list = QuoteList.find(params[:id])