myquote1/app/controllers/search_controller.rb

  def index
    category_query = params[:category_query]
    if category_query.present?
      @categorymatch = QuoteList.joins(:category, :quote).where("categories.name LIKE ?", "%#{category_query}%")
      @quote_texts = @categorymatch.pluck('quotes.quote_text')
---
SELECT "quote_lists".* FROM "quote_lists" INNER JOIN "categories" ON "categories"."id" = "quote_lists"."category_id" INNER JOIN "quotes" ON "quotes"."id" = "quote_lists"."quote_id" WHERE (categories.name LIKE '%Ethics%' AND quotes.isPublic = 1)
SELECT "quotes"."quote_text" FROM "quote_lists" INNER JOIN "categories" ON "categories"."id" = "quote_lists"."category_id" INNER JOIN "quotes" ON "quotes"."id" = "quote_lists"."quote_id" WHERE (categories.name LIKE '%Ethics%')