myquote1/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kayle@myquotes.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(email: params[:email]) # Find user in the database from user email