myquote1/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # Make sure only Admins can see all users
    if logged_in? && is_administrator?
      @users = User.all

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_admin", 1], ["updated_at", "2023-10-17 02:47:13.934185"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)