myquote1/app/views/search/index.html.erb

<p style="font-variant:small-caps">
    <% Category.all.each_with_index do |cat, index| %>
        <%= cat.name %>
        <%= "|" unless index == Category.count - 1 %>
---
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"