myquote1/app/views/home/uindex.html.erb

SELECT COUNT(*) FROM "quotes" WHERE "quotes"."user_id" = ? AND "quotes"."isPublic" = ?  [["user_id", 8], ["isPublic", 1]]
---

<p>You have uploaded a total of <%= current_user.quotes.count %> quotes (<%= current_user.quotes.where(isPublic: true).count %> public and <%= current_user.quotes.where(isPublic: false).count %> private).</p>